xml-mgmt-Request-Delete_IDCREDS.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:man="http://www.datapower.com/schemas/management">
    <soapenv:Header/>
    <soapenv:Body>
        <man:request domain="kirby_domain">
            <man:del-config>
                <CryptoIdentCred name="10.0.20.20_IDCREDS_2"/>
            </man:del-config>
        </man:request>
    </soapenv:Body>
</soapenv:Envelope>